### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Import Dependencies
import pandas as pd

In [2]:
# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

In [3]:
# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [4]:
# Find unique players to calculate the totalnumber of players
unique_names = purchase_data["SN"].unique()
unique_names
# To find total number of players
total = len(unique_names)
total_players = pd.DataFrame({"Total Players": [total]})
total_players

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [6]:
len(purchase_data)

780

In [7]:
#Run basic calculations to obtain number of unique items
number_of_unique_items = purchase_data["Item ID"].unique()
unique = len(number_of_unique_items)
unique

179

In [8]:
#Run basic calculations to obtain number of average price
avg_purchase_price = purchase_data["Price"].mean()
avg_purchase_price

3.050987179487176

In [9]:
# Run basic calculations to obtain number of purchases
total_number_of_purchases = purchase_data["Item Name"].count()
total_number_of_purchases

780

In [10]:
# Run basic calculations to obtain total revenue
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [11]:
# Create a summary data frame to hold the results
purchasing_analysis = pd.DataFrame({"Number of Unique Items": [unique],
                                    "Average Price": [avg_purchase_price],
                                    "Number of Purchases": [total_number_of_purchases],
                                    "Total Revenue": [total_revenue]})
purchasing_analysis

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [12]:
#Optional: give the displayed data cleaner formatting
purchasing_analysis = pd.DataFrame({"Number of Unique Items": [unique],
                                    "Average Price": '${:,.2f}'.format(avg_purchase_price),
                                    "Number of Purchases": total_number_of_purchases,
                                    "Total Revenue": '${:,.2f}'.format(total_revenue)})
purchasing_analysis

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [13]:
# Create data frame with just SN and Gender information
df_gender = purchase_data[["SN","Gender"]]
df_gender

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
775     Aethedru70  Female
776         Iral74    Male
777     Yathecal72    Male
778        Sisur91    Male
779      Ennrian78    Male

[780 rows x 2 columns]

In [14]:
# Drop duplicated rows to keep only unique SN in new data frame
df_gender = df_gender.drop_duplicates(subset="SN", keep="first")
df_gender

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
773         Hala31    Male
774     Jiskjask80    Male
775     Aethedru70  Female
777     Yathecal72    Male
778        Sisur91    Male

[576 rows x 2 columns]

In [15]:
# Create a summary table with the count of unique SN by Gender using groupby function
summary_by_gender = df_gender.groupby(["Gender"]).count()
summary_by_gender

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [16]:
# Rename the column SN as Total Count 
summary_by_gender=summary_by_gender.rename(columns={"SN":"Total Count"})
summary_by_gender

                       Total Count
Gender
Female                          81
Male                           484
Other / Non-Disclosed           11

In [17]:
# Percentage of players can be found by taking the count of players by gender and dividing with total number of players
percentage=summary_by_gender/summary_by_gender.sum() *100
percentage

                       Total Count
Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722

In [18]:
# Add the percentage of players data as a newcolumn into the summary table
summary_by_gender["Percentage of Players"]= percentage
summary_by_gender

                       Total Count  Percentage of Players
Gender
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

In [19]:
# Format the percentage data accordingly
summary_by_gender["Percentage of Players"]= summary_by_gender["Percentage of Players"].map('{:,.2f}%'.format)

In [20]:
# Sort the data frame by Total Count in descending order
summary_by_gender = summary_by_gender.sort_values("Total Count", ascending=False)
summary_by_gender

                       Total Count Percentage of Players
Gender
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

In [21]:
# To display the summary data frame
summary_by_gender[["Total Count", "Percentage of Players"]]

                       Total Count Percentage of Players
Gender
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [25]:
#Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender

gender = purchase_data.groupby("Gender")
gender

In [26]:
purchase_count = gender["Age"].count()
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Age, dtype: int64

In [27]:
avg_purchase_price = gender["Price"].mean()
avg_purchase_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [28]:
purchase_total_per_person = gender["Price"].sum()
purchase_total_per_person

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [30]:
avg_purchase_per_person = (gender["Price"].sum()/unique)
avg_purchase_per_person

Gender
Female                    2.022011
Male                     10.992402
Other / Non-Disclosed     0.280391
Name: Price, dtype: float64

In [32]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [54]:
# Create a summary data frame to hold the results
summary_df = pd.DataFrame({"Purchase count":purchase_count,"Average Purchase Price":avg_purchase_price,"Total Purchase Value":purchase_total_per_person ,"Average Purchase Total per Person":avg_purchase_per_person})

In [55]:
summary_df

,Purchase count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Gender,,,,
Female,113,3.203009,361.94,2.022011
Male,652,3.017853,1967.64,10.992402
Other / Non-Disclosed,15,3.346000,50.19,0.280391

In [56]:
# Optional: give the displayed data cleaner formatting
summary_df["Average Purchase Price"] = summary_df["Average Purchase Price"].map("${:.2f}".format)
summary_df["Total Purchase Value"]  = summary_df["Total Purchase Value"].map("${:,.2f}".format)
summary_df["Average Purchase Total per Person"] = summary_df["Average Purchase Total per Person"].map("${:.2f}".format)
summary_df.head()

,Purchase count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Gender,,,,
Female,113,$3.20,$361.94,$2.02
Male,652,$3.02,"$1,967.64",$10.99
Other / Non-Disclosed,15,$3.35,$50.19,$0.28

In [57]:
# Display the summary data frame
summary_df.head()

,Purchase count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Gender,,,,
Female,113,$3.20,$361.94,$2.02
Male,652,$3.02,"$1,967.64",$10.99
Other / Non-Disclosed,15,$3.35,$50.19,$0.28

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame